[
    {"review_id": "rw5704482", "reviewer": "raeldor-96879", "movie": "After Life (2019– )", "rating": "9", "review_summary": "Very Strong Season 2", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "I enjoyed the first season, but I must say I think season 2 is even stronger. Ricky does a great job as both writer, actor and director and brings out the best in a superb supporting cast. If there was one thing I'd change, I'd like to hear him talk about himself less with other people and speak more in the third person, but other than that it's pretty hard to fault this funny yet emotional comedy.", "helpful": ["1", "1"]},
    {"review_id": "rw5704483", "reviewer": "dosleeb", "movie": "The Valhalla Murders (2019– )", "rating": "6", "review_summary": "Icelandic detectives?", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "I know Iceland is a small country and police do things a bit different in Europe but c'mon... The incompetent police work robs this show of any believability.\n1st Detective: \"hey we got two persons of interest we need to talk with and one of them could possibly be the serial killer, which one should we visit first?\"\n2nd Detective: \"lets split up!\"", "helpful": ["2", "2"]},
    {"review_id": "rw5704484", "reviewer": "brightconscious", "movie": "Special OPS (2020– )", "rating": "7", "review_summary": "Nothing special", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Except K K , no other actor looks comfortable in acting. Fight scenes are funny and plot is repeattative.", "helpful": ["0", "0"]},
    {"review_id": "rw5704485", "reviewer": "gasconyway", "movie": "#BlackAF (2020– )", "rating": "8", "review_summary": "Good but", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "I'm guessing that as a 62 year old white woman I'm not the target demographic but I enjoyed this show. Good to see others perspectives and loved the wry humor. More entertaining than The Office and Parks & Rec. It does make broad negative assumptions about all whites though", "helpful": ["5", "9"]},
    {"review_id": "rw5704487", "reviewer": "mmason-15867", "movie": "The Droving (2020)", "rating": "2", "review_summary": "An honest review", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Here's the truth. There's not much to this movie at all. I was sucked in by the high rating and overly positive reviews that must have submitted by cast and film crew. I won't give a technical analysis like an ameteur movie critic, just my sincere opinion.The Droving was annoying from the jump due to not being able to hear the opening dialogue over the ambient sounds. At times it was so difficult to hear what was being said, I had to turn on the caption. I knew after that The Droving was starting with a negative balance and really good things had to happen moving forward to win me over.Film is beautiful with many nature scenes. It does not appear to be low budget from that standpoint. It also has a decent pace, so I didn't fall asleep (I was close on occasions). With those things being stated, cinematographer and pace could not save this film and rightfully so!Where the Droving falls apart, is with the story, in my humble opinion. The premise is interesting but the story is not well developed. The main character is almost as much as a mystery as the movie's story itself. The climax is very anticlimactic and evolves rapidly to an abrupt ending that left me scratching my head.Finally, there are worse movies out there than The Droving. It had potential to be a good watch, but missed the mark majorly with story and character development. Background sound made it difficult at times to hear dialogue and ending was a total letdown; making it a film that can be bypassed for most other movie options.", "helpful": ["26", "41"]},
    {"review_id": "rw5704488", "reviewer": "schroederagustavo", "movie": "All About Eve (1950)", "rating": "10", "review_summary": "Amazing", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Having seen this film for the first time today, 70 years after its release and still having the impact that it has is outstanding. Excellent writing, directing and performances all around, particularly by Bette Davis and Anne Baxter in their respective immortal roles, as well as unpredictable and filled with complex characters and relationships, All About Eve is one of the best movies I have ever seen.As I got about halfway through the movie, I thought it was about how jealousy and resentment can drive the people away from you. But it's not. It's a movie about manipulation and how horrible people can con people into getting what they want. It's such a great film.", "helpful": ["0", "1"]},
    {"review_id": "rw5704489", "reviewer": "welhof1", "movie": "Runaway Train (1985)", "rating": "7", "review_summary": "Impressive action scenes!", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "The movie had some very impressive scenes. Especially the ones that involved the cast fumbling around the rail cars. The incident with the other train plus the runaway train crashing into things was pretty cool.As I was watching I was thinking how bad the acting was from the two leads. Jon voight especially. His voice was comical. Then I find out they both were nominated for academy awards? I just didn't get it.Worth the watch I guess.", "helpful": ["0", "1"]},
    {"review_id": "rw5704490", "reviewer": "Evastar", "movie": "Iron Fist (2017–2018)", "rating": "9", "review_summary": "Another great Netflix Marvel show!", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "I loved it from the first episode! And I couldn't stop binge-watching it! Love the plot, the actors, the connection to the other 3 shows and the action scenes, which share the same punch-blood-blood-and-more-blood-kick-ass spirit!", "helpful": ["7", "9"]},
    {"review_id": "rw5704491", "reviewer": "tioeta", "movie": "The Half of It (I) (2020)", "rating": "4", "review_summary": "Needed the other half of the movie to cover up the messy writing", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "I see that Netflix has a teenage/kids audience and this is why they are making yet another typical rom-com. This movie was suppose to stand out from the rest of the Netflix standards.Unfortunately..The writing was horrible. Love is messy but that doesn't mean the writing should be messy too! It seemed like the writer wanted to make a messy love story but forgot to actually focus on the STORY and rather just used quotes that left us with nothing. The characters had no depth and I felt like the writer was trying too hard to make them sound philosophical rather than just being a normal teenager trying to actually find love and not be in a 70 years old mind.\nNeeded another 1h and 40min to cover up all the many and messy parts of the movie.What triggeres me the most is that through out the whole movie the main core is \"WHAT IS LOVE\" where the movie follows how love is messy but actully never focuses on the long journey of it. All of a sudden the movie is rushed to an ending where all of the 3 protagonists finds the \"key\" to love and then knows everything about love after a KISS and some cliche quotes. COMEON. SHOW US THE LIVELIHOOD OF LOVE. Not the vague idea written in books with random quotes about the universe and stars.Of course the soundtrack has to be good just to occopy the teenagers mind to think that the movie is so great even though it's not. 4 stars for acting, soundtrack, editing etc..", "helpful": ["16", "26"]},
    {"review_id": "rw5704492", "reviewer": "stephenrifkin", "movie": "This Is Us (2016– )", "rating": "2", "review_summary": "All the Pearsons are high maintenance and self righteous", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "This is the show for people for whom nothing even mildly bad has ever happened so they can wallow in the mediocre miseries of others. But keep in mind that the Pearsons are all incredibly high maintenance and self righteous. There's the Pearsons and then there's everyone else and their petty concerns", "helpful": ["1", "5"]},
    {"review_id": "rw5704494", "reviewer": "andrewtschroeder", "movie": "Closure (I) (2018)", "rating": "9", "review_summary": "Fun and intriguing", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "This is a fun and intriguing mystery. The acting is strong, Catia Ojeda does a great job as the lead. Its a funny film with a lot of quirky characters, it also looks great. Bonus: Dee Wallace is in it!", "helpful": ["2", "2"]},
    {"review_id": "rw5704493", "reviewer": "UniqueParticle", "movie": "Unstoppable (2010)", "rating": "8", "review_summary": "Excellent last film of legendary Director Tony Scott", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "A suspenseful thrilling adventure about a loose train with 2 workers inside it (Denzel Washington) and (Chris Pine) have to try to stop it. The sound is incredible nice that it was at least nominated for an Oscar! The cinematography is wildly beautiful too, Unstoppable is great for the ride of glorious film that it is!", "helpful": ["3", "4"]},
    {"review_id": "rw5704496", "reviewer": "Hellooo1234321", "movie": "Dangerous Lies (2020)", "rating": null, "review_summary": "Not bad", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Highlight was Camila Mendes exceptional acting skills! Story could've been better. I wanted more details in the storyline, then it was a at least a 7.", "helpful": ["2", "3"]},
    {"review_id": "rw5704497", "reviewer": "flippereight", "movie": "Beastie Boys Story (2020)", "rating": "3", "review_summary": "The apology tour", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "A lot of excuses and apologizing for their politically incorrect work in the past. I wish they had just owned it. They were doing what they thought was funny; they shouldn't have to apologize for their comedy.", "helpful": ["8", "20"]},
    {"review_id": "rw5704500", "reviewer": "ovandoreyna", "movie": "Ruben Brandt, Collector (2018)", "rating": "10", "review_summary": "Magnificent art-animation", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "A fenomel animation, a fabulous storyline. A vivid example of what imagination is.", "helpful": ["0", "1"]},
    {"review_id": "rw5704499", "reviewer": "Pairic", "movie": "Some Kind of Hate (2015)", "rating": "7", "review_summary": "Vengeful Spirit", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Some Kind Of Hate: Lincoln (Ronen Rubenstein) is a Goth, bullied at home and at school, he finally strikes back, stabbing a bully in the face with a fork. He ends up being sent to to the Mind's Eye Academy, a reform school in the desert which encourages spiritual growth. But he faces more bullies there. His angst summons up the vengeful ghost of Moira (Sierra McCormick), a girl who committed suicide at the school due to bullying. She begins to deal with the bullies. Blood runs freely as Moira makes it look as if the bullies are committing suicide. She is terrifying to behold, her limbs slashed from self-harming, wearing a necklace of razor blades. A disturbing film which will stick in your mind long after the final credits roll. Good performances by Rubenstein and McCormick. IMDB has it at 4.5/10 but I think Director Adam Egypt Mortimer's bloody horror flick deserves 7/10. On the Horror Channel.", "helpful": ["1", "2"]},
    {"review_id": "rw5704501", "reviewer": "driftingintime", "movie": "Cube Zero (2004)", "rating": "10", "review_summary": "NOT FOR KIDS!", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "I actually liked this movie but it traumatized my little brother (10 yrs old). We're used to watching horror movies together but this movie scared him to the point that he fainted. Definetely don't watch it with your little kids or siblings.", "helpful": ["0", "2"]},
    {"review_id": "rw5704502", "reviewer": "Stay_away_from_the_Metropol", "movie": "Carne (1991)", "rating": "8", "review_summary": "Like watching Noe's legacy squeeze out the birth canal & full of sauce", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Well, I just finished watching Gaspar Noe's CARNE (1991), and now I have seen all of his movies. Not as many people know about Carne because it's a 35 minute short film, not a feature length film - BUT, his debut feature film I STAND ALONE is actually a direct continuation of what occurs in CARNE. Though I have known about I STAND ALONE since about 2003, I didn't hear about CARNE until this year. I actually think CARNE is superior to I STAND ALONE - because of the short runtime it's paced very quickly and features more of Gaspar's stylish cutting and editing. It is thoroughly entertaining, while I STAND ALONE is more a slow-burning, icky-feeling build to a wretched climax that will make pretty much everyone feel like they need to take a shower afterwards.Any way, this movie is very good. Probably one of the best short films I have ever seen. The singular style is turned up to 10. The performances are on point. And the dialogue, subject matter, and some of the visuals are immensely jarring. Though I STAND ALONE is not a movie I would ever recommend to anyone (because of the sickening subject matter), I suggest that for those who are interested, do not watch I STAND ALONE without seeing CARNE first. They should be watched in sequence, just as one should watch something like KILL BILL Vol. 1 and 2.Now that I've seen all of Gaspar Noe's films... I would rank them in this order...ENTER THE VOID > IRREVERSIBLE > CLIMAX > CARNE > LOVE > I STAND ALONE", "helpful": ["4", "4"]},
    {"review_id": "rw5704504", "reviewer": "vostf", "movie": "500 Days of Summer (2009)", "rating": "5", "review_summary": "Cutie indie, just boring enough not to rise above its ambition", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Ah Indies done by brainerds who rever the verbose French New Wave, the intellectual misfits at a loss to communicate with others, especially the other sex. Too bad we are only offered this type of character, acting as a decoy for the screenwriter's psychoanalysis, and thus get a boring train of self-lamentation, more moaning and perennial inability to pull oneself by one's bootstraps.Bring in a good cast, fine production values (as opposed to erratic camera work and post-modernist settings), spread it all over by cutting back and forth in the timeline and bam, you get a cutesy indie. As usual this might have be an excellent short... provided the main character was beefed up with some self deprecating humor for instance.", "helpful": ["0", "1"]},
    {"review_id": "rw5704503", "reviewer": "sharonrota", "movie": "8½ (1963)", "rating": "10", "review_summary": "Maybe the biggest masterpiece in the history of cinema", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Everybody should watch this movie. It's pure art. It's difficult even to explain what genre it is, because it includes realism and surrealism, drama and comedy, critique to the society and more psychological matters. Every dialogue and scene are meaningful. It never came off as pretentious to me, quite the opposite, while the memory of Mastroianni are between the best and most satisfying scenes in the history of cinema. Actually I think the whole asa nisi masa scene is the best scene ever made. This is a real work of art. Many times, when you watch old movies, you get the feeling they are depicting something that belongs to the past and past only or the way they depict things is too linear, but this movie truly is universal and one of the most important pieces of the history of cinema.", "helpful": ["2", "3"]},
    {"review_id": "rw5704505", "reviewer": "boblipton", "movie": "Glimpses of New Scotland (1947)", "rating": "5", "review_summary": "Nova Scotia, That Is", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "James A. Fitzpatrick sends the Technicolor cameras to Nova Scotia under the supervision of cinematographer Virgil Miller. Now that the War was over, the MGM Traveltalks series could venture far afield, which meant distant Canada. Then he spends much of his time babbling, as he usually does, information gathered out of almanacs and governmental brochures. Did you know that Nova Scotia sent about a million and a half barrels of apples every year to Britain? Now you do. How large are these barrels? When you find out, let me know.Most of the images are fairly rustic, including covered bridges and pleasant countrysides. The copy that plays on Turner Classic Movies is is very good shape, and the images are very pleasant. If only Fitzpatrick would shut up and let us enjoy them!", "helpful": ["0", "1"]},
    {"review_id": "rw5704507", "reviewer": "indieevan", "movie": "The Master (2012)", "rating": "8", "review_summary": "Great Potential, Less Great Execution", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "The premise was a 10, but the execution left a good bit to be desired in certain areas.", "helpful": ["1", "1"]},
    {"review_id": "rw5704508", "reviewer": "sjahidul", "movie": "Thappad (I) (2020)", "rating": "10", "review_summary": "Must watch for all the men!!", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "I don't usually write reviews but I had to make an IMDb account and write a review for this one. Great work by director Anubhav Sinha. It's a masterpiece. It's that part of social discussion that people barely speak about. It's a must watch for all the men out there. This might be the awakening that most of us men needed and this one movie can bring about a change in the thought process and behaviour in a lot of men and also a glimpse of realisation in some men who thought it was okay for women to take a beating now and then.I would also like to add that the men who do not like this movie are the men who think they are superior to women and this movie hurt their ego.", "helpful": ["1", "2"]},
    {"review_id": "rw5704509", "reviewer": "swtnlow54", "movie": "Matchmaker Mysteries: A Fatal Romance (2020) Season 1, Episode 2", "rating": "10", "review_summary": "Great mystery", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "I love the two of main characters in this mystery. Delightful and cute!!", "helpful": ["3", "5"]},
    {"review_id": "rw5704510", "reviewer": "jamesmwanzia-62626", "movie": "Dangerous Lies (2020)", "rating": "1", "review_summary": "Some b***$h!t", "review_date": "3 May 2020", "spoiler_tag": 1, "review_detail": "Low budget though had a good cast but too many story holes and just disapointing over ambitous they tried to give us a parasite ending but failed terribly", "helpful": ["2", "4"]},
    {"review_id": "rw5704511", "reviewer": "moviereviewer6700", "movie": "Brooklyn Nine-Nine (2013– )", "rating": "10", "review_summary": "My Favourite Show Ever! - This Review Contains Spoilers!!!!", "review_date": "3 May 2020", "spoiler_tag": 1, "review_detail": "I already loved Andy Samberg from the Lonely Island and several of his films that he starred in before I found Brooklyn Nine-Nine but this show has taken his ability to make me cry with laughter to another level. Worthy credit must be humongously mentioned as well to Dan Goor & Michael Schur for writing such a masterpiece of a show that is TV GoldHaving arrived late to this show (started watching when Season 6 came out) I knew that I had the opportunity to binge watch seasons upon seasons if I liked it and it only took 3 episodes for me to know it was the show for me. Having not been a big fan of the pilot the second episode of Season 1 was better and by the third I wanted to watch more and more with one of the best parts being when you rewatch old episodes it feels like your watching them for the first time again.The characters all fit together in their own way without anyone overplaying their part, they're also hilariously funny & practically all of them are extremely likeable none more so IMO than Gina Linetti (Chelsea Peretti) also additionally I could possibly say that Amy Santiago & Jake Peralta are quite argubaly the best couple to come out of a TV show potentially ever. Furthermore, I also love Terry's fascination of Yoghurt & speaking in the third person, Rosa's character development throughout the show & Captain's Holt unique take on life.All in all, this is my favourite show and I hope it is commissioned for more series once I have finished the current one", "helpful": ["6", "8"]},
    {"review_id": "rw5704512", "reviewer": "lizadeegan", "movie": "After Life (2019– )", "rating": "10", "review_summary": "A work of pure genius", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "I love everything about this show. I thought they couldn't improve on series 1 but they have! I think I cried in every episode! The characters are so well drawn and human. Ricky is a phenomenal comedian and brilliant actor. His portrayal of a grief stricken husband will break your heart. You can genuinely feel his pain despite the odd glimmer of the happy man he used to be. Of course, I have to mention the dog - oh my God!!! I love the dog!!!! Watch this show please but prepare for tears!!!! Keep up the great work Ricky!!!! You're a legend.", "helpful": ["3", "3"]},
    {"review_id": "rw5704513", "reviewer": "pmc69", "movie": "Fool's Gold (I) (2008)", "rating": "1", "review_summary": "Terrible", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "One of the worst movies i have ever seen. Terrible plot and even worse acting. The whole movie was shockingly bad. Do not watch it. Save yourself time.", "helpful": ["0", "0"]},
    {"review_id": "rw5704514", "reviewer": "meenanirankari", "movie": "The Raikar Case (2020– )", "rating": "9", "review_summary": "If you ABSOLUTELY hate cliffhangers, do not watch it until next season arrives..", "review_date": "3 May 2020", "spoiler_tag": 1, "review_detail": "Umm what can i say that doesnt gives away spoiler.. Every it keep you on your toes but there are some element that seemed unnecessary.. It still on a huge cliffhanger.. If only i knew it before watch because i don't enjoy them at all.. It's gonna take away my goodnight sleep now but still it was a good watch..\nYou should hate Eklavya (it's not what you are thinking.. This is purely based as a woman and a human..)", "helpful": ["0", "0"]},
    {"review_id": "rw5704515", "reviewer": "isaharo", "movie": "Vida (2018–2020)", "rating": "10", "review_summary": "Hooked!", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "My girlfriend and I just started watching it and we are hooked! Sadly finding out there is only 3 seasons. We hope they continue making more seasons. We loved the drama, The Latino pride ,Also the LGBT community. We love how they don't sugar code anything.", "helpful": ["1", "3"]},
    {"review_id": "rw5704516", "reviewer": "ian-437", "movie": "Airplane Mode (II) (2019)", "rating": "8", "review_summary": "Very silly, funny movie", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "I guess the world has gotten too serious for movies like this.", "helpful": ["1", "13"]},
    {"review_id": "rw5704517", "reviewer": "mysprouts-740-813856", "movie": "Bloodline: Part 13 (2015) Season 1, Episode 13", "rating": "7", "review_summary": "I'm rating the whole season", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Woo this family. They make my family look normal and that's scary. The first few episodes were tedious. We're told how horrible Danny is without much reason why. They finally start showing his true colors in a way that felt organic. So many lies and unspoken Truths. So many family secrets. And my interest was held for several episodes until the very end. By the end I couldn't figure out why these people want to be in each others lives. They are all miserable. Their relationships are so toxic.\nIt's a good show worthy of watching but it's so hard to get behind any of the characters. I just want one of them to make a good choice. They just keep chasing bad choice after bad choice.", "helpful": ["0", "0"]},
    {"review_id": "rw5704518", "reviewer": "seanbrowne-30204", "movie": "Once Upon a Time in London (2019)", "rating": "1", "review_summary": "One word, Pony", "review_date": "3 May 2020", "spoiler_tag": 1, "review_detail": "What a load of tosh....absolute waste of time. No real story, cardboard acting and was like watching a violent series of heartbeat.", "helpful": ["1", "4"]},
    {"review_id": "rw5704519", "reviewer": "xuefeiding", "movie": "Jia you er nü (2005– )", "rating": "9", "review_summary": "Troubles of Chinese Family Growth", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "When I was a kid, I saw a classic and educational family sitcom. I like the way that parents and children can communicate like friends. Liu Xing, the eldest son of the three children, is really mischievous, but also gives the audience a lot of joy. I like xiadonghai. He can educate children rationally most of the time. Now that I'm older, I feel very relaxed when I watch this play. It's a good play to relieve pressure.", "helpful": ["0", "0"]},
    {"review_id": "rw5704520", "reviewer": "kryss-19208", "movie": "Hollywood (2020)", "rating": "10", "review_summary": "Incredible", "review_date": "3 May 2020", "spoiler_tag": 1, "review_detail": "This show was incredible. Every bit was so satisfying. I kept waiting for something to go horribly wrong because of the time period. As if there was no way any of it would have been allowed to happen back when the show was set. It may be a fantasy, but imagining where the world could be if this HAD all happened 60 years ago is such an incredibly wonderful thought.", "helpful": ["11", "27"]},
    {"review_id": "rw5704521", "reviewer": "NinnaMali97", "movie": "After Life (2019– )", "rating": "9", "review_summary": "Authentic", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Simple and relatable with the right amount of humour. Ricky Gervais made me laugh and cry at the same time. Just brilliant. I wish there were more stories like this.", "helpful": ["1", "1"]},
    {"review_id": "rw5704522", "reviewer": "saumitrashanu", "movie": "Four More Shots Please (2019– )", "rating": "1", "review_summary": "Messing upon situation", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Unrealistic, I mean the way they are living is very complex", "helpful": ["6", "9"]},
    {"review_id": "rw5704523", "reviewer": "nadyaruray", "movie": "Kingdom (2019– )", "rating": "6", "review_summary": "Ridiculous on Season 2", "review_date": "3 May 2020", "spoiler_tag": 1, "review_detail": "Overall it's a worthy binge watching series, it's just that the Prince character you'd find is not realistic (you'll know when you hit season 2). The other odd thing is, Seo-bi can avoid the zombies with a single fireball but all the soldiers just died at the end even when they know that the zombies are afraid of fire. Just doesn't make sense to me.", "helpful": ["2", "5"]},
    {"review_id": "rw5704525", "reviewer": "westsideschl", "movie": "Sonic the Hedgehog (2020)", "rating": "3", "review_summary": "Fast Food Level Quality", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "1. Animation detail & quality, mostly just the blue one was animated, was average at best, but most of the time it was below average blocky cheap.\n2. Script was cheap formula of nasty human villain out to steal power of the blue one, but, of course, another human to the rescue. Villain highlight was his mustache.\n3. Flat, humorless, dialogue aimed probably at the middle school level.\n4. Really bad science to fill people's brains. Besides the faster than light for a biological being (forget the energy demands) was the really dumb ring portal to the opposite side of the Universe. Obviously the writers have no idea what that really means, but sound good.\n5. Left open more of the same easy money junk food w/our nasty scheming his way back.", "helpful": ["0", "0"]},
    {"review_id": "rw5704526", "reviewer": "patlovescats-39586", "movie": "For the Love of Jessee (2020)", "rating": "7", "review_summary": "Good story", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Good story. I watch a lot of hallmarks and this movie pulled at my heartstrings.", "helpful": ["0", "1"]},
    {"review_id": "rw5704527", "reviewer": "juliapiotrowska", "movie": "Trying (2020)", "rating": "10", "review_summary": "Strongly recommend", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Amazing series, very funny and heartwarming. Can't wait for the 2nd season", "helpful": ["9", "16"]},
    {"review_id": "rw5704528", "reviewer": "gradyharp", "movie": "Red Joan (2018)", "rating": "8", "review_summary": "'Nobody would suspect us. We are women'", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Jennie Rooney's novel RED JOAN, based on the true story of British physicist Melita Norwood, unmasked as the KGB's longest serving British spy in 1999 at age 87, is transferred to the screen by Lindsay Shapero and under the direction of Trevor Nunn the story becomes a time lapse chronicle of the young Joan acting out her convictions and the elderly Joan facing trial for those acts.Very briefly, Joan Stanley (Judi Dench as the elder Joan, Sophie Cookson as the young Joan), a physicist in the 1903s, becomes employed as a British government civil servant and works with Professor Max Davies (Stephen Campbell Moore) and together they work on the concept of physics that deals with creating the atomic bomb. She is 'courted ' by her friend Sonja (Tereza Srbova) and her brother Leo (Tom Hughes), supporters of the Soviet party, and is convinced to share the information about the making of the bomb with Stalin's Russia - partly because Joan hypothetically believes all powerful countries should have access to the A bomb in order to maintain equality and prevent abuse of the bomb in the manner the US used in the destruction of Hiroshima and Nagasaki. Mixed with love affairs and fear Joan transfers the secret information to Soviet Russia, and her secrecy lasts until 1999 when MI5 agents arrest her. The film opens with contemporary time and then flashes back and forth to the 30s and 40s in a manner that makes the story credible.An excellent cast, especially Dench and Cookson, brings this story to life and the impact, whether you agree with the premise or not, makes the film absorbing. G", "helpful": ["1", "3"]},
    {"review_id": "rw5704529", "reviewer": "ersildsherja", "movie": "The Wandering Earth (2019)", "rating": "4", "review_summary": "I wanted an amazing sci fi experience but I got an OK instead", "review_date": "3 May 2020", "spoiler_tag": 1, "review_detail": "The effects are dazzling but the physics, not so much. From the scene of the father and his friend are trying to navigate around a HUGE space station while in airlock, to the ignition of Jupiter itself, it felt like science had died and these two teenagers and a group of policemen were going to revive it. Overly melodramatic, people don't have to cry in every single occasion. The comic relief was all in all bad but I take it as it was better than most of the conversation in the film. Still though, the special effects were second to none. The grandfather was the best actor.", "helpful": ["1", "4"]},
    {"review_id": "rw5704530", "reviewer": "lormejourdan", "movie": "The Chosen (2017– )", "rating": "10", "review_summary": "Excellent Show", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "This show is like no other Christian show that depicts the disciples of Christ. Each character has their unique personality and they feel like real people. You can relate to reach character. Even Jesus has a human personality. The interactions between Jesus and everyone just brings tears to my eyes as it is so personal and brings up so many emotions. I wish the episodes never ended.", "helpful": ["0", "0"]},
    {"review_id": "rw5704532", "reviewer": "arrmeen", "movie": "Mrs. Serial Killer (2020)", "rating": "1", "review_summary": "Can I please post a 0 rating here? I had to give it a 1 cause IMDb don't except 0", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Oh my god ,what in the world's name is this is it a movie or a pathetic piece of overindulgence in so called cinema making. Where do I start? the so called direction, sorry don't expect any of it cause whoever directed this is not worthy of directing even a 30 second YouTube video. So next stop at acting .. Let me tell you one thing besides Manoj Bajpai who by the way hams through his part and Jacqueline you won't even recognize the rest of the pathetic display of actors. Who cast them..Why?? Who wrote this ? Why did Netflix even produce this garbage.\nPlease trust my review, I am in no way in some opposite camp here to tarnish this utter garbage.\nAvoid , don't even watch the trailer it's that hopeless.\n0 🌟 out of 10", "helpful": ["0", "0"]},
    {"review_id": "rw5704531", "reviewer": "dcb-27", "movie": "The Art of Racing in the Rain (2019)", "rating": "8", "review_summary": "So we go through all that and...", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "He/they don't even get another dog? That makes no sense. None at all. Enzo was taken everywhere with him so there's no way if he did get a new dog that it would not be with them at the race track. Adopt don't shop..... Otherwise there are some interesting things to be learned in this quaint film. One of the better things to watch on TV these days: May 2020", "helpful": ["0", "2"]},
    {"review_id": "rw5704533", "reviewer": "sbachan-112-284518", "movie": "Upload (2020– )", "rating": "9", "review_summary": "Great Sci-Fi and Very Well Acted", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "I binged this over two days. Hilarious at times and terrific drama as well. The lead actors have excellent chemistry which makes even more of a pleasure to watch. Definitely has a Altered Carbon vibe, with the San Junipero episode of Black Mirror.", "helpful": ["3", "8"]},
    {"review_id": "rw5704535", "reviewer": "dwp1948", "movie": "Battle Los Angeles (2011)", "rating": "4", "review_summary": "Mediocre Alien Invasion Movie - Even Michelle Rodriguez & Aaron Eckhart Couldn't Save It", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "05/03/2020 Apparently the writer and director thought that big name actors plus lots of GI Joes screaming and yelling their loudest with little kids squealing non stop would be a good substitute for something/anything that might look like aliens invading earth? It didn't, and this p*** poor movie proves it. I hope to \"NEVER\" accidentally watch this loud bunch of time wasted film again. Bon Appetit'SUMMARY: Who knew that \"Outer space Aliens\" wanted to live in Los Angeles? They must have read some liberal news article about so many illegal aliens living there? Democrats welcome them and will show them how to vote in a one party political mail-in-your votes ... your votes ... your votes system.", "helpful": ["3", "6"]},
    {"review_id": "rw5704536", "reviewer": "baunvig-42642", "movie": "Hunters (2020– )", "rating": "3", "review_summary": "Kinda boring", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Old hat. Blonde people evil, other people good. Nice violence once in a while.", "helpful": ["2", "5"]},
    {"review_id": "rw5704537", "reviewer": "robertbv", "movie": "Roped (2020)", "rating": "1", "review_summary": "Very predictible sweet movie", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "A very predictible sweet little movie. It has the pace of a Christian movie.", "helpful": ["11", "22"]},
    {"review_id": "rw5704538", "reviewer": "mail-95391", "movie": "Sonic the Hedgehog (2020)", "rating": "7", "review_summary": "Sonic's movie career to be better than Mario's", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "I enjoyed the Sonic the Hedgehog movie. Well, most of the time I couldn't stop thinking about all the actors having to act with absolutely nothing. Here, look at this. This right here is a little blue creature running around. And of course the whole story about how they changed the little blue creature. I think they definitely changed him for the better. But the real thing I couldn't stop thinking about when I watched the sonic movie is what a better movie career Sonic is going to have than Mario and what a surprise. What a beautiful way for Sonic And Sega to enact their final and, albeit small revenge against Nintendo for the loss of the console wars. The Sonic movie is definitely better than the Mario movie, although that was years ago. And it's better than the Mario TV show too.Jim Carrey is fantastic is Dr. Robotnik, and I expect him to be even better in the sequel, Sonic is actually likable as a cartoon character, and the rest of the human cast do a fine job supporting him, similar to any Garfield movie. I really enjoyed the sonic movie. I'd suggest watching it. Thanks so much for reading this review. I hope you liked it.", "helpful": ["0", "0"]},
    {"review_id": "rw5704539", "reviewer": "burkebuilder", "movie": "Brightburn (2019)", "rating": "1", "review_summary": "Not good", "review_date": "3 May 2020", "spoiler_tag": 1, "review_detail": "No good place to start a review for a bad movie like this. A bad cross between Superman and the Oman. A kid comes from space and crash lands on a farm (parents know this).Strange things start to happen involving him, but the parents don't seem to think it's a big deal. This movie lost me there. How can you have a son from space and not think he's capable of unusual conduct?Seems like some college kids got drunk and wrote an \"idea\" for a movie, then had some parents in good with a movie producer who gave this nonsense the green light to make. I'm so tired of bad movies that are total rip offs with a silly, cliche twist.", "helpful": ["4", "5"]},
    {"review_id": "rw5704540", "reviewer": "jonathanvanholstein", "movie": "Outer Banks (2020– )", "rating": "8", "review_summary": "Adventure vibe; underage drinking and drugs; but a fun show", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "The show has a good adventure and treasure hunt vibe. I love that about it. The mystery. It reminds me of Blood & Treasure or any other treasure hunt show or movie. The dialogue is well written. Every character is unique and has there own vocabulary.The big thing that shocked me was that the characters were 16. This is only said when you're a few episodes in. And after that, they say it all the time, that they're just sixteen-year-olds or teenagers. In my mind, the characters were 17/18 maybe 19. Especially seeing them using drugs and drinking. Now, that can happen off course. But it felt a bit unreal and over the top.In completion, the first season was fun to watch. There is much potential for a second one. And I am curious where that will take the show. Especially, as I have read that the writers are planning a 4-5 season show.", "helpful": ["0", "0"]},
    {"review_id": "rw5704541", "reviewer": "mcufre-42321", "movie": "Battle Los Angeles (2011)", "rating": "8", "review_summary": "If you look for good action you'll enjoy this movie. If you're looking for depth stay away.", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "This movie is packed with great action and effects. The main characters are well developed and grow on you (secondary characters not so much). It's a fun ride and I'm giving it a rating based on what the movie wanted to be and not what some people may have expected of it. This is not deep sci fi with any in depth delving on what the whole situation is about, it's all about this group of marines trying to survive against all odds and showing extreme heroism and if you like that kind of thing you'll like this movie.", "helpful": ["0", "1"]},
    {"review_id": "rw5704542", "reviewer": "nogodnomasters", "movie": "The Field Guide to Evil (2018)", "rating": "7", "review_summary": "Story is a lie", "review_date": "3 May 2020", "spoiler_tag": 1, "review_detail": "This is an international anthology of local folklore. The stories are short. Some are good with a twist. Most were interesting. The topics included a haunted palace, the kallikantzaro, the trud, the Djinn, a virgin tale, melonheads, a princess curse, and of course Qunicy Jones, The Drude.Guide: F-word Nudity (Marlene Hauser , Luzia Oppermann, Urszula Zerek )", "helpful": ["3", "3"]},
    {"review_id": "rw5704543", "reviewer": "drszilviavas", "movie": "Code 404 (2020– )", "rating": "10", "review_summary": "Brilliant comedy, amazing actors", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Loved every minute of it, binge watched all episodes at one go. It's funny, silly, action packed, easy to watch, full of British humour, wit and all the actors make the storyline so enjoyable. Don't overthink it, just open a bottle of vine, sit back and have a laugh. Thank you so much. I absolutely love Stephen Graham (the reason why I picked this series), just proved it again that he is one of the best British actors and now seen Richard Gadd, so funny, they work so well together. Please make another series ASAP.", "helpful": ["7", "11"]},
    {"review_id": "rw5704544", "reviewer": "txnicole333", "movie": "What Love Looks Like (2020)", "rating": "8", "review_summary": "Lighthearted and fun", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Fun, lighthearted romantic comedy with five stories of young love. Is easily relatable for the millennial crowd, and a glimpse back to the sweet awkward days of dating for the older crowd. Very cute movie.", "helpful": ["11", "12"]},
    {"review_id": "rw5704545", "reviewer": "nomanza", "movie": "Memento (2000)", "rating": "6", "review_summary": "Complicated, nice story.", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "It's very complex and complicated. The whole film consists of flashbacks, which is very hard to watch. But you're solving the puzzle. At the end there are still pieces of the puzzle lacking.\nIt's a very complex story. Too many flashbacks. There is no red thread.", "helpful": ["5", "7"]},
    {"review_id": "rw5704546", "reviewer": "tierney-steve", "movie": "The Invisible Man (2017)", "rating": "2", "review_summary": "Probably the worst film I've seen in the past 5 years", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Watched this by mistake thinking it was the 2020 Invisible Man and thought I'd see it through to the end. Writing this review so others done waste a tad over an hour of their lives. I won't discuss the negatives because I wouldn't know where to start.", "helpful": ["0", "1"]},
    {"review_id": "rw5704548", "reviewer": "itskyms", "movie": "For the Love of Jessee (2020)", "rating": "10", "review_summary": "Will Watch Again", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "I purchased the movie on Amazon so I have it digitally and will buy the DVD. I can watch this multiple times.You should watch this if you like realistic life trials and tribulations. It is set in such a cute town - I will definitely be visiting Wickenburg AZ! The setting was beautiful.The score was great. The person who did the score is talented.Tony Denman was awesome playing Luke's friend.I'm glad Adrienne Barbeau's character came around in the end.Also, there are HORSES!", "helpful": ["1", "2"]},
    {"review_id": "rw5704549", "reviewer": "raj-loyal", "movie": "Hundred (2020– )", "rating": "9", "review_summary": "Good use of Retro music", "review_date": "3 May 2020", "spoiler_tag": 1, "review_detail": "The series has a novel concept, not that someone is dying and wants to life their life to the fullest but how am ambitious cop manipulates this situation. The story, acting and direction all are too notch, acting is good not just by the leads but also the supporting cast. Rinku proves herself once again but Lara outdid herself. Best part is the music, you can experience the best use of Retro music. It brings back to life some iconic songs and others that are pretty much forgotten. A good watch. 1 extra star just for the music.", "helpful": ["2", "2"]},
    {"review_id": "rw5704550", "reviewer": "brooksrob1", "movie": "Billions: The New Decas (2020) Season 5, Episode 1", "rating": "10", "review_summary": "Season 5 takes off and Hit's it out of the park, er, table...", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "If you're an avid watcher of the series; you already know how great it is...There are changes coming, telegraphed in last season but they leave the door open as to their future. Giamatti is his usual self; he draws you in... EVERYONE is back... which is great, because the characters are interesting and multi leveled. This series is so tight. Everyone involved just hits their marks and it's refreshing to hear interesting dialog and to watch twisting subterfuge being played out so well...", "helpful": ["9", "33"]},
    {"review_id": "rw5704551", "reviewer": "swededawg", "movie": "Mannix (1967–1975)", "rating": "9", "review_summary": "Intelligent writing", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Loved the series when it was first on and now I have the DVD set which I watch when exercising. What made it so good was the humanity of Mannix and the scripts were so intelligent. Joe was just so likable and always wanting to do the right thing. I have to chuckle though, they seemed to use the same basement set throughout the series but would just change the items in the scene. And Joe got driven off the same road in several episodes but I only notice because I watch the episodes sometimes 4 or 5 days a week. Bottom line, this is a series that withstood time and great care went into the plots. The filming was terrific, real pros behind the cameras. Mike Connors was a gentleman even off the show. He was going to be Matt Helmin the movie series until Dean Martin wanted the role and it worked out for both of them.", "helpful": ["1", "1"]},
    {"review_id": "rw5704552", "reviewer": "townferret", "movie": "Little Fires Everywhere (2020)", "rating": "8", "review_summary": "Page Turner Story", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "I enjoyed this series, it kept me caring what happened next even though the plot is contrived and the depth of the social issues being raised were without resolution, they were the cultural artifact to write the dialogue around. Consequences of every action are implied and yet karma is random.The theme is that families and parenthood and existence are messy enterprises and the lines of character are disconnected. It also highlights that America is way too self absorbed. Our emotions are structured around the past; the dictates of peers and the media, while being dogmatically controlled by defense mechanisms which defy change and growth.", "helpful": ["4", "5"]},
    {"review_id": "rw5704553", "reviewer": "balldave", "movie": "Midsomer Murders: The Axeman Cometh (2007) Season 10, Episode 4", "rating": "6", "review_summary": "Boomer Fun", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Barnaby acting like a schoolgirl reliving his 70s music crush.. okay episode with maybe too many obnoxious characters and one glaring error of Barnaby noting that the Eagles made it big in 1972 with Desperado..they were big before and Desperado was 73 ....", "helpful": ["2", "2"]},
    {"review_id": "rw5704555", "reviewer": "Esraa1990", "movie": "Tales from the Loop (2020– )", "rating": "8", "review_summary": "Slow Paced Emotional Artistic sci-Fi series..", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "If you waiting for hard core sci- Fi series like Stranger Things or Dark or even west world. this is definitely not your show . I don't like a lot of sci-fi series and mostly because they have no soul in them and they always want to make you on edge with a lot of killing and violence or unnecessary humor or over complications and multilayered events that make you lose track of everything..Well, This is very different ..This is a simple stories connected together and told in the most beautiful simple way possible. Some stories were better than others ,but the emotion of time and heaviness of it was incredibly overwhelming. The music ..oh my God the music and the cinematography are so beautiful and made a lot of scenes like a dream . I loved the last episode so much Jodie Foster and Rebecca Hall are amazing. I hope there will be season 2 with much better stories and for the show to be more recognized than trending and popular ones.", "helpful": ["3", "7"]},
    {"review_id": "rw5704556", "reviewer": "beaudare-70996", "movie": "Dakota Incident (1956)", "rating": "10", "review_summary": "\"You throw all the rules right out the window, don't you? \"", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "As an American actor/ screenwriter who loves Westerns, I find \"The Dakota Incident\" a hidden classic, with it's deft dialogue and uniquely clever romance between the lovely, talented Linda Darnell and the surprisingly skillful Dale Robertson. The scene where they are trapped in the dry wash in the desert and playfully fence with each other, is priceless. When Darnell says, \"You throw all the rules right out the window, don't you?\" And Robertson replies, \"That's just the way you like it, barroom style\", is one of the best moments in Western films. A very, underrated Western.... Beau Dare", "helpful": ["0", "0"]},
    {"review_id": "rw5704557", "reviewer": "anooppinto", "movie": "Mrs. Serial Killer (2020)", "rating": "1", "review_summary": "Pathetic acting", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "One of the worst movies of 2020, bad acting,direction and plot", "helpful": ["0", "0"]},
    {"review_id": "rw5704558", "reviewer": "moaath_sabbagh", "movie": "How I Met Your Mother: 46 Minutes (2012) Season 7, Episode 14", "rating": "1", "review_summary": "boring!!!!!!!!!", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Ugh\nhow I met your mother was very good but now guys ...\nahhhhhhhh I miss friends", "helpful": ["1", "6"]},
    {"review_id": "rw5704559", "reviewer": "angelahptrio", "movie": "Laverne & Shirley: The Survival Test (1980) Season 5, Episode 22", "rating": "6", "review_summary": "Mediocre show", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "It's an okay episode. I would like it more if there's more with Sargent Plow", "helpful": ["0", "0"]},
    {"review_id": "rw5704560", "reviewer": "rivertam26", "movie": "Prey (V) (2019)", "rating": "6", "review_summary": "Nifty teen version of predator", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Blumhouse produced this nifty teen version of Predator. It centers around a young man who goes on a sort of survival retreat after his father is murdered. After arriving solo he soon discovers hes not alone. He gathers up his strength to try and survive until the boat comes back. It's a suspenseful little horror flick even though it's a bit underdeveloped. More character and story work would have really hit the concept home. All in all not a bad watch.6/10", "helpful": ["0", "1"]},
    {"review_id": "rw5704561", "reviewer": "viktortje007", "movie": "Memento Mori (II) (2018)", "rating": "1", "review_summary": "See above", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "The 'Blood and Sand' review is obviously written by a featured actor or maybe director. This movie is not worth your time.", "helpful": ["4", "5"]},
    {"review_id": "rw5704563", "reviewer": "Kirpianuscus", "movie": "Tatame (2016)", "rating": null, "review_summary": "people", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "It is is more than a documentary about Brasilian professional wrestling. It has the gift to be a touching portrait of simple men front to a tough competition. Their vulnerability, fears, emotions and stories are the real important and the basic virtue is the fine craft to present them.", "helpful": ["1", "1"]},
    {"review_id": "rw5704564", "reviewer": "contact-125-651146", "movie": "Charade (1963)", "rating": "9", "review_summary": "A Hitchcock movie that he didn't direct. It", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "An excellent cast: Cary Grant (in an superb performance), Katherine Hepburn, Walter Matthau, James Coburn, George Kennedy. All of them giving us a great performance.\nLike the trailer of this movie said: suspense, comedy, and romance. All of them in perfect balance. I would include action.\nNothing went wrong on this movie.\nand we can't forget the soundtrack, composed by Henry Mancini.\nI can't understand why this movie and Cary Grant didn't get any Oscar nomination except the soundtrack.\nThe main title was made famous by bhave being sung by Andy Williams although his performance didn't appear in the movie.", "helpful": ["1", "3"]},
    {"review_id": "rw5704565", "reviewer": "xfile-69236", "movie": "Batwoman: Grinning from Ear to Ear (2020) Season 1, Episode 14", "rating": "10", "review_summary": "Best Yet", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "This is the best episode that I have seen if this series. Love the origin of female Joker.", "helpful": ["3", "11"]},
    {"review_id": "rw5704566", "reviewer": "mail-95391", "movie": "Trolls World Tour (2020)", "rating": "8", "review_summary": "Great film to teach kids about different types of music", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Trolls world tour is a fantastic movie. And I'm surprised to be saying that as I mainly watched trolls World Tour, because of its incredible historical significance as the movie that broke movie theaters. I don't know if many of you are aware, but Universal Pictures decided to release trolls World Tour directly to streaming bypassing the theaters, for the first time in history, duuuu dooo daaaa. Even now, amc movie theaters is boycotting Universal Pictures and refusing to carry any of their films as universal enjoyed great success with this strategy and doesn't have to share the hundred million dollars they made on trolls World Tour with anybody.But back to the movie itself. The movie is a delightful children's film about different types of music, and how they can all work together in the end, from rock to pop to classical to funk to rock to... that's about it. but all the different styles of music, a little bit of reggae a little bit of Kpop, some smooth jazz (normal jazz seems to be ignored entirely,\nI guess funk is part of jazz). Anyway all of these different types of music come together in a beautiful story that I think will teach kids about the importance of listening to different types of music. This is a great lesson and a valuable kids movie. Great songs for adults who will recognize a lot of them. Kids will find them all to be brand new, especially the ones where they change the words.Enjoy trolls World Tour! It's a great movie, almost like a music video. And the animation looks great. Thanks so much for reading this review, I hope you like it.", "helpful": ["0", "2"]},
    {"review_id": "rw5704567", "reviewer": "FeastMode", "movie": "Arachnophobia (1990)", "rating": "3", "review_summary": "another crappy old movie", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "I remember liking this when i was a kid. i still like spiders. decided to give it another viewing. unfortunately it is just another crappy old movie filled with OMA (old movie attributes). lots of stupid stuff. barely scary and only occasionally funny. (about 3 viewings, 5/2/2020)", "helpful": ["0", "9"]},
    {"review_id": "rw5704568", "reviewer": "louiseransil", "movie": "Jojo Rabbit (2019)", "rating": "10", "review_summary": "A Weirdly Wonderful Film", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Third generation German, I was resistant to seeing this film. I remember asking European relatives -- as only a child would -- \"Why did you follow Hitler?\" Their answer: \"He told us we were the most important country in the World, he'd make us great again -- and rich.\"With what's going on in our Country now -- I understand those people much better...", "helpful": ["1", "7"]},
    {"review_id": "rw5704569", "reviewer": "brandywreath", "movie": "Hollywood (2020)", "rating": "10", "review_summary": "It was clearly a wishful rendition....", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "I love some of the reviews here. Why write a fiction when the real story is soooo interesting you ask? Why have any fiction then. Why not dream of a better reality and share that dream in the hopes it can continue to become a reality? I love star wars and am glad it was made even though there have been real wars that were interesting. Come on....\nI loved this movie and I too have imagined where we might be today had this really happened some 60 years ago.\nHow many people would not have had to live a lie? How many suicides avoided? How many broken homes saved? How many.....\nStory was amazing as was the acting. Wish there was more.", "helpful": ["25", "48"]},
    {"review_id": "rw5704571", "reviewer": "wandernn1-81-683274", "movie": "Lost Child (2017)", "rating": "7", "review_summary": "I enjoyed it.", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "+1 Star for a Great LineIt was a story told well. It's definitely a reference to a backwoods culture. It's not about city dwellers. It does have a few flaws, but to me it was worth the watch. It was a bit of a surprise. We need more stories about finding lost children!!!", "helpful": ["4", "5"]},
    {"review_id": "rw5704572", "reviewer": "adeleysim", "movie": "Halloween III: Season of the Witch (1982)", "rating": "4", "review_summary": "Ridiculous", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Makes some really wild leaps in logic, including the main character being inexplicably popular with the ladies. Really campy and not even in a good way.", "helpful": ["16", "30"]},
    {"review_id": "rw5704573", "reviewer": "amandajkelly", "movie": "Normal People (2020)", "rating": "10", "review_summary": "Beautiful look at first love", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "First loves are strong and complex, and the story about Marianne and Connell's on and off again love story is beautifully complex. This show (and book) looks at two different young Irish adults growing up together through secondary school and college and how their lives became intertwined. You'll catch yourself thinking about your own experiences that you'll have to rewind to catch what you missed on the show. The actors, fresh and new to the screen, breath life into the characters. The raw and honest look at first love will leave you craving more.", "helpful": ["2", "3"]},
    {"review_id": "rw5704574", "reviewer": "dancinqueen-38603", "movie": "Book of Mormon Videos (2019–2021)", "rating": "10", "review_summary": "The Book of Mormon", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "The Book of Mormon is a testament of Jesus Christ. These short films are a collection of films based off actual events. If you watch them and pray about it you will know that they are true.", "helpful": ["7", "10"]},
    {"review_id": "rw5704576", "reviewer": "mail-95391", "movie": "Like a Boss (2020)", "rating": "4", "review_summary": "At least I watched it till the end.", "review_date": "3 May 2020", "spoiler_tag": 1, "review_detail": "I watched like a boss, because it was released in 2020 and I'm trying to watch and review all the movies made and released in 2020, maybe the last Hollywood movies ever made.Like a boss is not a movie made for me. Like a boss is a movie about two female entrepreneurs who have been working together their whole life and how they were nearly ripped apart by Salma Hayek, and her evil plan to rip apart female entrepreneurs who are friends, because she was ripped apart from her female entrepreneur friend (later revealed, spoiler alert to be none other than Phoebe buffet from friends. Lisa Kudrow.)That's about it for the review of the movie. I enjoyed the part where the women kept smoking joints and got in trouble for smoking joints at their friend's house. It was also great to see the dislike thrown upon these single working women from their married pregnant friends. And then the way that dislike quickly morphed into jealousy, later on, when the girls were going through trouble. It's a decent movie, the plot could have been better. It could have made more sense and been more straightforward but it's the slam together gobbly goo that they came up with. at least they didn't force any unnecessary romance on the characters, instead, mainly focusing on the business relationship, and the friendship. Like a boss, a title better than the film. I hope you enjoyed this review. Thank you for reading.", "helpful": ["1", "2"]},
    {"review_id": "rw5704575", "reviewer": "veerabahee", "movie": "The Reliant (2019)", "rating": "1", "review_summary": "Top 10 Movies of the decade", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Right. It is exactly similar to to the tile of the review and the actual review. It would be one in the list of of TOP 10 MOVIES OF THE DECADE. Ten minutes in with the worst story line was bored to the core. Save yourself.", "helpful": ["2", "6"]},
    {"review_id": "rw5704577", "reviewer": "nicholasfiumara", "movie": "The Twilight Zone: Where Is Everybody? (1959) Season 1, Episode 1", "rating": "10", "review_summary": "Everybody is gone from this small town he has amnesia and doesn't know who or where he is.", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "This amazing episode shows a pilot is suffering from amnesia . He goes to a small town and doesn't know where he is. He goes into empty stores and still see no one! He's enjoying ice cream but later leaves to another store and seen books on a rack reading \" The Last Man On Earth .\" Now he is starting to break down after what he has been experiencing.", "helpful": ["1", "1"]},
    {"review_id": "rw5704578", "reviewer": "dankolbet", "movie": "Upload (2020– )", "rating": "9", "review_summary": "Unique and easy to devour in a binge", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Great concept, coupled with flawless execution and no filler episodes or stray secondary storylines? Yep. Good stuff.", "helpful": ["3", "8"]},
    {"review_id": "rw5704579", "reviewer": "dimitardimitrov-47886", "movie": "After Life (2019– )", "rating": "10", "review_summary": "Brilliant", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Absolutely fantastic-really lovely.\nLove it\nKeep up the good work Ricky", "helpful": ["3", "3"]},
    {"review_id": "rw5704580", "reviewer": "hackraytex", "movie": "Rapid Exchange (2003 Video)", "rating": "9", "review_summary": "How did they do it?", "review_date": "3 May 2020", "spoiler_tag": 1, "review_detail": "I am not the sharpest tool in the drawer but how did Ketchum and Brooks not get killed falling out of the plane? My only guess is that they has parachutes under their coveralls but it would have been nice for such a scene to be included.", "helpful": ["0", "0"]},
    {"review_id": "rw5704581", "reviewer": "mountainbeasty", "movie": "The Visit (I) (2015)", "rating": "8", "review_summary": "Great idea, great movie", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Don't read about this movie, just watch it. No preconceptions, no expectations. It's a superb and simple idea executed well.", "helpful": ["6", "7"]},
    {"review_id": "rw5704582", "reviewer": "angelahptrio", "movie": "Laverne & Shirley: The Duke of Squigman (1980) Season 5, Episode 23", "rating": "8", "review_summary": "Squiggy sleep walks", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "One of the first Lenny and Squiggy centre episode. Lenny is a good friend he worries about Squiggy's sleepwalking. When he goes to the Psychiatrist at work you can tell his frustration keeping an eye on Squiggy. Squiggy is not used to expressing his feelings which he must do. I like the episode.", "helpful": ["2", "2"]},
    {"review_id": "rw5704583", "reviewer": "iwfcyb", "movie": "Behind the Curve (2018)", "rating": "7", "review_summary": "2 Part Quick Review", "review_date": "3 May 2020", "spoiler_tag": 1, "review_detail": "So, I want to comment on the 2 aspects I came across while watching this. First, it was EXTREMELY hard for me to watch. Now, admittedly, I have a hard time witnessing the depths of stupidity humanity has sprinkled within in. Always have, always will. This runs from flat earthers to religion and beyond. So this self failing negativly impacted my experience watching this. My gut reaction was to rate it much lower, but I know that wouldn't be fair for anyone reading this and thinking about watching it.Second, as for the documentary itself, it was well done in one sense, but misleading in another. Most people going into it will think it's at least in part going to have some decent arguments from the flat earthers to justify their belief. However, the best \"proof\" that was given was \"I can see that building there. If the Earth was round, I shouldn't be able to see it\". Face palm. Instead, 90% of it was aimed at the personalities and mental mindsets of people who consider themselves flat earthers, and fortunately, it doesn't paint them in a very flattering light. The editing was well done, the people included in the documentary were ...... interesting, and the creators did their best to not go out of their way to make the believers look like fools.....that's something they did all on their own, so in a way, it was nice to see the producers and director not pile it on.Bottom line, if you have spare time to kill and witnessing how ridiculous some of your neighbors can be doesn't bother you, it's entertaining enough.", "helpful": ["0", "0"]},
    {"review_id": "rw5704584", "reviewer": "moviereviewer6700", "movie": "Mean Girls (2004)", "rating": "8", "review_summary": "Fabulous and Funny at the same time - THIS REVIEW CONTAINS SPOILERS!!!", "review_date": "3 May 2020", "spoiler_tag": 1, "review_detail": "If your looking for a movie that you could potentially class as a real guilty pleasure then you might not have to look much further. As someone who doesn't usually watch these types of movies I absolutely loved it and for such a film to get such a stellar cast with names like Lindsay Lohan, Amanda Seyfried, Rachel McAdams & Tina Fey. I was pleasantly surprised at how much on screen chemistry there was and it all seemed to just fall into place.Lohan's character Cady is incredibly likeable from the start. A girl who has moved to a new school learning about cliques and the social hierachy. Rachel McAdams does a stunning job playing leader of the 'Plastics' Regina George where she's just catty enough to be seen as sort of an antagonist but not too much that it ruins the aesthetic of the film & a mention must be given to Amanda Seyfried for the brilliantly talented acting of the character Karen (your typical pretty but also pretty thick girl) all this with Fey's writing and good humoured portrayal of teacher Ms. Norbury and it's easy to see why this movie has helped launch careers of these actors and actresses (specifically Lohan)Having said that I would like to have seen the original characters stay or go back for a second movie without the need to potentially almost rush an ending like they did with Cady, Karen, Regina & Gretchen. It's like if they were to keep that ending but for the end of a second movie and have new events leading up to that.Overall though, a thoroughly enjoyable movie that made me laugh and had me rooting for Cady from almost the very beginning. Totally recommend and would watch again (over and over possibly)", "helpful": ["1", "1"]},
    {"review_id": "rw5704586", "reviewer": "backus1611-1", "movie": "Turistas (2006)", "rating": "7", "review_summary": "A movie highlighting the arrogance of European Conquerors.", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "So, finally, a horror film about the absolute arrogance of the European conquerors, because that's exactly who the bad-guy doctor was- a European descendant. His \"I'm tired of rich Americans buying our organs\" speech was hilarious, since his descendants did exactly what he was \"sick of\" use, abuse and dictate over, the natives. And, that's not to mention what he says about the native \"indian\" in the final few minutes, (plus what he does with another earlier in it. So, as a movie about the arrogance of Europeans and their dominance decades if not a century before US dominance, this was an enjoyable experience.But, I doubt that's what they had in mind when they made the movie. I'm guessing it was yet another whiny attempt to whine about America and what they did (which was horrible by the way- United Fruit Company), and if it was, boy did they get it completely wrong by not hiring a Brazilian \"indian\" to be head bad-guy. But, wow, did the Europeans screw with S. America- so much that even the \"natives\" had a caste system where the lighter the skin the 'better'.As a movie, finally, it was fine. I watched the unrated, for extra gore!", "helpful": ["0", "0"]},
    {"review_id": "rw5704587", "reviewer": "dpraptor", "movie": "Light from the Tower (2020)", "rating": "1", "review_summary": "As Bad as a High School Student Film", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Please do not believe all the 9's & 10's. I really hate it when the crew tries to make a terrible movie look great. This was beyond amateurish, on level with student films you see online. Acting was from people who acted like they were never in front of the camera before and could barely remember their lines. I think the movie they were trying to make would have been much better than this. If you ignore this warning you will lose an 1:15 you will never get back.", "helpful": ["14", "16"]},
    {"review_id": "rw5704589", "reviewer": "ashernelson", "movie": "Spider-Man 3 (2007)", "rating": "10", "review_summary": "You know.......", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Very good movie, the action was spectacular! The Villans were well thought up, and the entire movie just all comes together.", "helpful": ["0", "2"]},
    {"review_id": "rw5704588", "reviewer": "josh-29279", "movie": "After Life (2019– )", "rating": "10", "review_summary": "Awesome production", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "The best viewing I've had in long time, so well written... bring us more.", "helpful": ["3", "3"]},
    {"review_id": "rw5704591", "reviewer": "levarela", "movie": "Doom: Annihilation (2019)", "rating": "1", "review_summary": "Garbage", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Insulting to the DOOM franchise, wasted all budget on final scene, hilarious and depressing at the same time that BFG 9000 was made with milk boxes... This actually should be removed from everywhere... Embarrassing movie.", "helpful": ["0", "2"]},
    {"review_id": "rw5704590", "reviewer": "adobe-rashad", "movie": "Apocalypse Now (1979)", "rating": "5", "review_summary": "Boooooooring", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Can't feel my legs, wasted 3 hrs for nothing... I gave it 5 for the picture only.", "helpful": ["4", "8"]},
    {"review_id": "rw5704594", "reviewer": "txnicole333", "movie": "Call for Dreams (2018)", "rating": "8", "review_summary": "Like being in a dream.", "review_date": "3 May 2020", "spoiler_tag": 0, "review_detail": "Very surreal mind-bending movie. You will have to read subtitles, but this movie is heavily visual so it is not too distracting. Unique and unsettling, like being in a dream.", "helpful": ["3", "3"]}
]
